<template>
  <svg
    width="20px"
    height="20px"
    viewBox="0 0 20 20"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlns:xlink="http://www.w3.org/1999/xlink"
    fill="currentColor"
  >
    <title>专业仓库</title>
    <defs>
      <linearGradient
        id="pro-repository"
        x1="94.515625%"
        y1="5.484375%"
        x2="6.3746875%"
        y2="93.6253125%"
      >
        <stop stop-color="#A4E0A7" offset="0%"></stop>
        <stop stop-color="#3BB346" offset="100%"></stop>
      </linearGradient>
    </defs>
    <g
      id="页面-1"
      stroke="none"
      stroke-width="1"
      fill="none"
      fill-rule="evenodd"
    >
      <g
        id="型号空间"
        transform="translate(-372.000000, -486.000000)"
        fill-rule="nonzero"
      >
        <g id="1备份-10" transform="translate(360.000000, 464.000000)">
          <g id="专业仓库" transform="translate(12.000000, 22.000000)">
            <rect
              id="矩形"
              fill="url(#pro-repository)"
              x="0"
              y="0"
              width="20"
              height="20"
              rx="6"
            ></rect>
            <g id="专业-专业课" transform="translate(5.000000, 6.000000)">
              <path
                id="路径"
                d="M9.9341018,3.35000001 L8.52956674,0.349999998 C8.37908085,0.149999996 8.17843298,0 7.92762314,0 L2.10883507,0 C1.85802524,0 1.6072154,0.149999996 1.50689146,0.349999998 L0.0521944458,3.35000001 C-0.0481294877,3.6 0.00203248445,3.90000001 0.152518379,4.1 L4.51660944,8.8 C4.66709533,8.9 4.81758124,9 5.0182291,9 C5.21887697,9 5.36936286,8.9 5.51984877,8.8 L9.83377786,4.05 C10.0344257,3.85 10.0344257,3.6 9.9341018,3.35000001 Z"
                fill="#A4E0A7"
              ></path>
              <path
                id="路径"
                d="M7.32567955,2.85 L5.0182291,5.45 L2.76094063,2.85 C2.61045473,2.7 2.35964489,2.65 2.15899703,2.80000001 C1.95834916,2.95 1.95834916,3.20000001 2.10883507,3.35000001 L4.46644747,6.05 C4.61693337,6.19999999 4.81758124,6.3 5.0182291,6.3 C5.21887697,6.3 5.41952484,6.19999999 5.51984877,6.05 L7.97778511,3.35000001 C8.12827101,3.20000001 8.07810905,2.95 7.92762314,2.80000001 C7.72697527,2.65000001 7.47616544,2.7 7.32567955,2.85 Z"
                fill="#FFFFFF"
              ></path>
            </g>
          </g>
        </g>
      </g>
    </g>
  </svg>
</template>
